OdDAIHostAppServicesBase.findSchemaFileName(OdAnsiString!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Returns name of file that contains EXPRESS schema definition associated with schemaIdentifier.
\returns Returns the OdAnsiString that contains name of file that contains EXPRESS schema definition.
\remarks
Default implementation contains mapping for following supported schemas:
Identifier                                          Protocol
CONFIG_CONTROL_DESIGN                               AP203
AUTOMOTIVE_DESIGN                                   AP214
INTEGRATED_CNC_SCHEMA                               AP238
AP242_MANAGED_MODEL_BASED_3D_ENGINEERING_MIM_LF     AP242
AP209_MULTIDISCIPLINARY_ANALYSIS_AND_DESIGN_MIM_LF  AP209
STRUCTURAL_FRAME_SCHEMA                             CIS/2